Обработки/Reports/_ОстаткиИПроцентыЭмиссииЦБВПортфелях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиИПроцентыЭмиссииЦБВПортфелях</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьПревышение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиИПроцентыЭмиссииЦБВПортфелях/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, "Остатки и проценты эмиссии ЦБ в портфелях", "0.13", , Истина);
		
		// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомлениеОНаличииАкцийВПортфеляхРЭМ", 	"Уведомление о наличии акций в портфелях (РЭМ)",,	Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "УведомлениеОНаличииАкцийВПортфеляхТраст", "Уведомление о наличии акций в портфелях (Траст)",,	Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции 

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	Настройки = КомпоновщикНастроек.Настройки;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 		ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодГраница",		Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 			ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПороговыйПроцент", 	ЭтотОбъект.ПороговыйПроцент);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыделятьПревышение",	ЭтотОбъект.ВыделятьПревышение);
	
	НеактуальныеАкции = Новый Массив;
	НеактуальныеАкции.Добавить(ОбщегоНазначения.ПолучитьИменованныйОбъект("Акция_ИнтерРАОНеактуальна"));
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НеактуальныеАкции",	НеактуальныеАкции);
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#Область Работа_с_Регламентными_Заданиями

// Интерфейс для запуска загрузки по регламентному заданию
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ИдОрганизации = "";
	
	Если СтрНачинаетсяС(ИдентификаторКоманды, "УведомлениеОНаличииАкцийВПортфелях") Тогда
		ЭтотОбъект.Период				= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, ТекущаяДата(), -2);
		ЭтотОбъект.Организация			= ПараметрыКоманды.Организация;
		ЭтотОбъект.ПороговыйПроцент 	= ПараметрыКоманды.ПороговыйПроцент;
		ЭтотОбъект.ВыделятьПревышение 	= Ложь;
		
		ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
		
		ИдОрганизации = СтрЗаменить(ИдентификаторКоманды, "УведомлениеОНаличииАкцийВПортфелях", "");
		ОтправитьУведомление(ПолучателиОповещения, ИдОрганизации);

	КонецЕсли;   	
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ОтправитьУведомление(ПолучателиОповещения, ИдОрганизации) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ЭтотОбъект.СкомпоноватьРезультат(ДокументРезультат); 
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
		ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
		
		ТемаПисьма = "Уведомление о наличии акций в портфелях (NSP) " + СокрЛП(ИдОрганизации) + " " + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yy");
		
		ТелоПисьма = Новый ТекстовыйДокумент;
		ТелоПисьма.Прочитать(ИмяВременногоФайла);
		
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТелоПисьма.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
		
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
